{
  "articles": [
    {
      "title": "COVID cases double among young people in Oxford following students’ return",
      "description": "Some data analysis of case rates in Oxford and Oxfordshire. Particular focus on the impact students made when returning to the city after the holidays.",
      "link": "https://cherwell.org/2022/01/31/ht22-cases-double/",
      "venue": "Cherwell"
    },
    {
      "title": "Can population density really tell us anything about Covid?",
      "description": "A look at how measuring population density at different scales can impact the way we understand transmission of viruses.",
      "link": "https://thecritic.co.uk/can-population-density-really-tell-us-anything-about-covid/",
      "venue": "The Critic"
    },
    {
      "title": "Booster jabs for the over-30s will begin TOMORROW",
      "description": "Some data analysis of case spreading rates during the height of the covid pandemic. Analysis conducted with national health and population data.",
      "link": "https://www.dailymail.co.uk/news/article-10300425/Booster-jabs-30s-begin-tomorrow.html",
      "venue": "Mail on Sunday"
    },
    {
      "title": "University ignore tribunal ruling on “discriminatory” retirement policy",
      "description": "Oxford University announces that it intends to continue enforcing a retirement policy which was ruled “highly discriminatory” by an employment tribunal.",
      "link": "https://cherwell.org/2020/01/26/university-ignore-tribunal-ruling-on-discriminatory-retirement-policy/",
      "venue": "Cherwell"
    },
    {
      "title": "St Hilda’s abolishes chapel in favour of multi-faith space",
      "description": "St Hilda's College Oxford announced that it would replace its college chapel with a multi-faith space.",
      "link": "https://www.cherwell.org/2020/01/31/st-hildas-abolishes-chapel-in-favour-of-multi-faith-space/",
      "venue": "Cherwell"
    },
    {
      "title": "MP delivers petition to block St John’s quarry",
      "description": "An MP delivered a petition in parliament to stop an Oxford college from building a quarry on its land in Warwickshire.",
      "link": "https://cherwell.org/2020/03/08/mp-delivers-petition-to-block-st-johns-quarry/",
      "venue": "Cherwell"
    },
    {
      "title": "Oscar Wilde’s Ring Returns to Magdalen College",
      "description": "A solid gold ring given as a gift of friendship by Oscar Wilde to his friend William Ward has been returned to Magdalen College almost 20 years after it was stolen from the college library.",
      "link": "https://cherwell.org/2019/12/12/oscar-wildes-ring-returns-to-magdalen-college-20-years-after-it-was-stolen/",
      "venue": "Cherwell"
    }
  ]
}
